[{"title":"Everything I Never Told You","author":"Celeste Ng","year":"2015","description":"\"Lydia is dead. But they don't know this yet. So begins the story of this exquisite debut novel, about a Chinese American family living in 1970s small-town Ohio. Lydia is the favorite child of Marilyn and James Lee; their middle daughter, a girl who inherited her mother's bright blue eyes and her father's jet-black hair. Her parents are determined that Lydia will fulfill the dreams they were unable to pursue-in Marilyn's case that her daughter become a doctor rather than a homemaker, in James's case that Lydia be popular at school, a girl with a busy social life and the center of every party. When Lydia's body is found in the local lake, the delicate balancing act that has been keeping the Lee family together tumbles into chaos, forcing them to confront the long-kept secrets that have been slowly pulling them apart. James, consumed by guilt, sets out on a reckless path that may destroy his marriage. Marilyn, devastated and vengeful, is determined to find a responsible party, no matter what the cost. Lydia's older brother, Nathan, is certain that the neighborhood bad boy Jack is somehow involved. But it's the youngest of the family-Hannah-who observes far more than anyone realizes and who may be the only one who knows the truth about what happened. A profoundly moving story of family, history, and the meaning of home, Everything I Never Told You is both a gripping page-turner and a sensitive family portrait, exploring the divisions between cultures and the rifts within a family, and uncovering the ways in which mothers and daughters, fathers and sons, and husbands and wives struggle, all their lives, to understand one another\"--","photoURL":"http://books.google.com/books/content?id=JEYCDAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","score":3,"pageCount":306},{"title":"All the Light We Cannot See","author":"Anthony Doerr","year":"2017","description":"\"From the highly acclaimed, multiple award-winning Anthony Doerr, a stunningly ambitious and beautiful novel about a blind French girl and a German boy whose paths collide in occupied France as both try to survive the devastation of World War II. Marie Laure lives with her father in Paris within walking distance of the Museum of Natural History where he works as the master of the locks (there are thousands of locks in the museum). When she is six, she goes blind, and her father builds her a model of their neighborhood, every house, every manhole, so she can memorize it with her fingers and navigate the real streets with her feet and cane. When the Germans occupy Paris, father and daughter flee to Saint-Malo on the Brittany coast, where Marie-Laure's agoraphobic great uncle lives in a tall, narrow house by the sea wall. In another world in Germany, an orphan boy, Werner, grows up with his younger sister, Jutta, both enchanted by a crude radio Werner finds. He becomes a master at building and fixing radios, a talent that wins him a place at an elite and brutal military academy and, ultimately, makes him a highly specialized tracker of the Resistance. Werner travels through the heart of Hitler Youth to the far-flung outskirts of Russia, and finally into Saint-Malo, where his path converges with Marie-Laure. Doerr's gorgeous combination of soaring imagination with observation is electric. Deftly interweaving the lives of Marie-Laure and Werner, Doerr illuminates the ways, against all odds, people try to be good to one another. Ten years in the writing, All the Light We Cannot See is his most ambitious and dazzling work\"--","photoURL":"http://books.google.com/books/content?id=giaLDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","score":5,"pageCount":544},{"title":"Redeployment","author":"Phil Klay","year":"2015","description":"\"Taking readers to the front lines of the war in Iraq and back, Redeployment asks us to understand what happened there, and what happened to the soldiers who returned\"--Back cover.","photoURL":"http://books.google.com/books/content?id=lKeMDQAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","score":3,"pageCount":304},{"title":"Euphoria","author":"Lily King","year":"2015","description":"English anthropologist Andrew Banson has been alone in the field for several years, studying the Kiona river tribe in 1930s New Guinea. Haunted by the memory of his brothers' deaths and increasingly frustrated and isolated by his research, Bankson is on the verge of suicide. Then he encounters the famous and controversial American anthropologist Nell Stone and her wry and mercurial Australian husband, Fen, who have just fled the bloodthirsty Mumbanyo. Nell and Fen and, in spite of Nell's poor health, are hungry for a new discovery. When Bankson finds them a new tribe nearby, the artistic, female-dominated Tam, he ignites an intellectual and romantic firestorm between the three of them that burns out of anyone's control.","photoURL":"http://books.google.com/books/content?id=5ry-oQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","score":2,"pageCount":288},{"title":"Big Little Lies","author":"Liane Moriarty","year":"2015","description":"The new novel from the author of The Husband's Secret A #1 New York Times Bestseller Sometimes it's the little lies that turn out to be the most lethal. A murder...A tragic accident...Or just parents behaving badly? What's indisputable is that someone is dead. Madeline is a force to be reckoned with. She's funny, biting, and passionate; she remembers everything and forgives no one. Celeste is the kind of beautiful woman who makes the world stop and stare but she is paying a price for the illusion of perfection. New to town, single mom Jane is so young that another mother mistakes her for a nanny. She comes with a mysterious past and a sadness beyond her years. These three women are at different crossroads, but they will all wind up in the same shocking place. Big Little Lies is a brilliant take on ex-husbands and second wives, mothers and daughters, schoolyard scandal, and the dangerous little lies we tell ourselves just to survive.","photoURL":"http://books.google.com/books/content?id=QNQBDAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","score":4,"pageCount":512},{"title":"Revival","author":"Stephen King","year":"2015","description":"\"The new minister came to Harlow, Maine, when Jamie Morton was a boy doing a battle with his toy army men on the front lawn. The young Reverend Charles Jacobs and his beautiful wife brought new life to the local church and captivated their congregation. But with Jamie, he shares a secret obsession - a draw so powerful, it would have profound consequences five decades after the shattering tragedy that turned the preacher against God, and long after his final, scathing sermon. Now Jamie, a nomadic rock guitarist hooked on heroin, meets Charles Jacobs again. And when their bond becomes a pact beyond even the Devil's devising, Jamie discovers that revival has many meanings\"--Back cover.","photoURL":"http://books.google.com/books/content?id=VLW2CAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","score":1,"pageCount":416},{"title":"Station Eleven","author":"Emily St. John Mandel","year":"2015","description":"A National Book Award Finalist A PEN/Faulkner Award Finalist Kirsten Raymonde will never forget the night Arthur Leander, the famous Hollywood actor, had a heart attack on stage during a production of King Lear. That was the night when a devastating flu pandemic arrived in the city, and within weeks, civilization as we know it came to an end. Twenty years later, Kirsten moves between the settlements of the altered world with a small troupe of actors and musicians. They call themselves The Traveling Symphony, and they have dedicated themselves to keeping the remnants of art and humanity alive. But when they arrive in St. Deborah by the Water, they encounter a violent prophet who will threaten the tiny band's existence. And as the story takes off, moving back and forth in time, and vividly depicting life before and after the pandemic, the strange twist of fate that connects them all will be revealed.","photoURL":"http://books.google.com/books/content?id=AQzRrQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","score":5,"pageCount":352},{"title":"Creativity, Inc.","author":"Ed Catmull,Amy Wallace","year":"2014","description":"The co-founder and president of Pixar Animation Studios presents a distillation of the ideas and management principles he has used to develop a the company's successful creative culture, reflecting on how Pixar's commitment to specific values has involved a daily effort. 80,000 first printing.","photoURL":"http://books.google.com/books/content?id=Il2inQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","score":1,"pageCount":340},{"title":"World of Warcraft: The Shattering","author":"Christie Golden","year":"2011","description":"In this follow-up to her NY Times bestseller, ARTHAS, Christie Golden delivers a sensational tie-in to the newest World of Warcraft game expansion!","photoURL":"http://books.google.com/books/content?id=4_6qjog5n3sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","score":3,"pageCount":432},{"title":"Eloquent JavaScript, 3rd Edition","author":"Marijn Haverbeke","year":"2018","description":"Completely revised and updated, this best-selling introduction to programming in JavaScript focuses on writing real applications. Eloquent JavaScript dives into the JavaScript language to show programmers how to write elegant, effective JavaScript code. Like any good programming book, Eloquent JavaScript begins with fundamentals--variables, control structures, functions, and data structures--then moves on to complex topics like object-oriented programming and regular expressions. This third edition introduces new features covering the 2017 version of JavaScript, such as class notation, arrow functions, iterators, async functions, template strings, and black scope. Author Marijn Haverbeke keeps the friendly tone and easy-to-follow explanations that made the original a hit, and he adds new exercises for readers to test their skills. Eloquent JavaScript will have readers fluent in the language of the web in no time, eloquently.","photoURL":"http://books.google.com/books/content?id=ZwL9swEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","score":4,"pageCount":472},{"title":"Learning JavaScript Design Patterns","author":"Addy Osmani","year":"2012","description":"An introduction to writing code with JavaScript using classical and modern design patterns, including modules, observers, facades, and mediators.","photoURL":"http://books.google.com/books/content?id=JYPEgK-1bZoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","score":3,"pageCount":235},{"title":"12 Rules for Life","author":"Jordan B. Peterson","year":"2018","description":"\"What does everyone in the modern world need to know? [The author's] answer to this most difficult of questions uniquely combines the hard-won truths of ancient tradition with the stunning revelations of cutting-edge scientific research. [The author discusses] discussing discipline, freedom, adventure and responsibility, distilling the world's wisdom into 12 practical and profound rules for life\"--Amazon.com.","photoURL":"http://books.google.com/books/content?id=sxVHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","score":4,"pageCount":448},{"title":"Cien años de soledad","author":"Gabriel García Márquez","year":"2009","description":"\"Muchos años después, frente al pelotón de fusilamiento, el coronel Aureliano Buendía había de recordar aquella tarde remota en que su padre lo llevó a conocer el hielo\". Con estas palabras empieza una novela ya legendaria en los anales de la literatura universal, una de las aventuras literarias más fascinantes del siglo xx. Millones de ejemplares de Cien años de soledad leídos en todas las lenguas y el Premio Nobel de Literatura coronando una obra que se había abierto paso a \"boca a boca\" --como gusta decir el escritor-- son la más palpable demostración de que la aventura fabulosa de la familia Buendía-Iguarán, con sus milagros, fantasías, obsesiones, tragedias, incestos, adulterios, rebeldías, descubrimientos y condenas, representaba al mismo tiempo el mito y la historia, la tragedia y el amor del mundo entero.","photoURL":"http://books.google.com/books/content?id=_2UCwD6jnWUC&printsec=frontcover&img=1&zoom=1&source=gbs_api","score":1,"pageCount":494},{"title":"El Extranjero","author":"Albert Camus","year":"2016","description":"es la primera novela del escritor francés Albert Camus, publicada en 1942. El protagonista, Meursault, es un ser indiferente a la realidad por resultarle absurda e inabordable. El progreso tecnológico le ha privado de la participación en las decisiones colectivas y le ha convertido en \"extranjero\" dentro de lo que debería ser su propio entorno.","photoURL":"http://books.google.com/books/content?id=9R1dvgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","score":2,"pageCount":66}]